In [ ]:
# measure of dispersion

In [ ]:
# variance:
    # it is a measure of dispersion which tells us 
    # that how far are the data points spread across the mean

In [3]:
import pandas as pd

In [4]:
data = pd.Series([1,2,3,4,5,5,6,6,7,7,54,3,2,2,22,34,5])

In [5]:
data

0      1
1      2
2      3
3      4
4      5
5      5
6      6
7      6
8      7
9      7
10    54
11     3
12     2
13     2
14    22
15    34
16     5
dtype: int64

In [6]:
x_mean  = data.mean()

In [7]:
x_mean

9.882352941176471

In [32]:
# (data - x_mean)**2
sample_variance = sum(pow((data - x_mean),2))/(len(data)-1)
population_variance = sum(pow((data - x_mean),2))/(len(data))

In [33]:
sample_variance,population_variance

(199.2352941176471, 187.5155709342561)

In [36]:
population_var = data.var(ddof=0)
sample_var = data.var()

In [37]:
population_var,sample_var

(187.5155709342561, 199.2352941176471)

In [38]:
data.std()

14.115073294802514

In [27]:
from math import sqrt

In [41]:
sqrt(sample_var)
sqrt(population_var)

13.693632495954319

In [44]:
import seaborn as sns

In [46]:
titanic_df = sns.load_dataset('titanic')

In [47]:
titanic_df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [55]:
cv_age = (titanic_df.age.std()/titanic_df.age.mean()) * 100

In [54]:
cv_fare = (titanic_df.fare.std()/titanic_df.fare.mean()) * 100

In [56]:
cv_age,cv_fare

(48.912218554656754, 154.307252784085)

In [53]:
data,data/data.mean()

(0      1
 1      2
 2      3
 3      4
 4      5
 5      5
 6      6
 7      6
 8      7
 9      7
 10    54
 11     3
 12     2
 13     2
 14    22
 15    34
 16     5
 dtype: int64,
 0     0.101190
 1     0.202381
 2     0.303571
 3     0.404762
 4     0.505952
 5     0.505952
 6     0.607143
 7     0.607143
 8     0.708333
 9     0.708333
 10    5.464286
 11    0.303571
 12    0.202381
 13    0.202381
 14    2.226190
 15    3.440476
 16    0.505952
 dtype: float64)

In [57]:
# titanic_df['age-age_mean']
# titanic_df['age-age_mean_squared']
# titanic_df['age-age_mean_squared_div_N']
# titanic_df['age_std_dev_variance']

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# Compute the Mean (μ): Calculate the arithmetic mean of the dataset.
# Compute the Variance (σ2): Calculate the variance of the dataset, which is the average of the squared differences from the mean.
# Compute the Standard Deviation (σ): Take the square root of the variance to find the standard deviation.
# Compute the Fourth Moment (μ4): Calculate the fourth moment of the dataset, which is the average of the fourth power of the differences from the mean.
Kurtosis = μ4/σ4​

In [60]:
titanic_df[['age','fare']].corr()

           age      fare
age   1.000000  0.096067
fare  0.096067  1.000000

In [62]:
iris_data = sns.load_dataset('iris')